# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'findutils'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'wget'
brew 'zsh-completions'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@8.1'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'supervisor'
brew 'yarn'

# Apps
cask 'adoptopenjdk'
cask 'datagrip'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'grammarly'
cask 'imageoptim'
cask 'jetbrains-toolbox'
cask 'lastpass'
cask 'meld'
cask 'microsoft-office'
cask 'pastebot'
cask 'phpmon'
cask 'postman'
cask 'ray'
cask 'raycast'
cask 'spectacle'
cask 'surfshark'
cask 'the-unarchiver'
cask 'todoist'
cask 'transmit'
cask 'trezor-suite'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id:409201541
